'''
1.Git是一種版本控制系統，可用於軟體開發或是其他類型的項目，像是規格書寫也可以放在Git上面，
  後續追蹤或多人可同時在Git的專案上工作，也可以記錄修改和修改的人是誰。
   Git有幾點特性:
    (1).分布式系統：每個開發者都有自己的存儲空間，除了自己的以外，也可以參考其他人的專案進行修正。
    (2).版本控制與歷史紀錄：每一次的修正更改都會有紀錄留存，方便追蹤紀錄，也適合進行版本控制。
    (3).樹狀式管理：可以從主軸中，拉分支出去進行開發或修正，確認無衝突且符合需求，在合併回去主軸。
    (4).合作便利性：同一個專案中可以有多人共同開發，並且方便他人協助code review。
    (5).開源性：Git是開源性軟體，大家都可以使用，普遍性較高。

2.
  (1).List：
        1-1.可改變的
        1-2.有序集合
        1-3.沒有型別限制
        e.g. l = [1, 'two', 3.0]

  (2).Dictionary:
        2-1.可改變的
        2-2.無序集合，有key value性質
        e.g. d= {'name': 'Alice', 'age': 30, 'city': 'New York'}

  
'''
